<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/4edcdc71-b0fd-4642-b2e4-a2b99890ae1d/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"
        name                               = "staging-cast-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:85" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:85" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-cast" -> (known after apply)
      ~ revision                 = 85 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.o11y.grafana_dashboard.dashboard will be updated in-place
  ~ resource "grafana_dashboard" "dashboard" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels        = [
                    # (5 unchanged elements hidden)
                    {
                        collapsed  = false
                        datasource = {
                            type = "datasource"
                            uid  = "grafana"
                        }
                        gridPos    = {
                            h = 1
                            w = 24
                            x = 0
                            y = 17
                        }
                        targets    = [
                            {
                                datasource = {
                                    type = "datasource"
                                    uid  = "grafana"
                                }
                            },
                        ]
                        title      = "ECS"
                        type       = "row"
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ matchExact       = false -> true
                                # (13 unchanged attributes hidden)
                            },
                          ~ {
                              ~ matchExact       = false -> true
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (10 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets       = [
                          ~ {
                              ~ matchExact       = false -> true
                                # (13 unchanged attributes hidden)
                            },
                          ~ {
                              ~ matchExact       = false -> true
                                # (13 unchanged attributes hidden)
                            },
                        ]
                        # (10 unchanged attributes hidden)
                    },
                    {
                        collapsed  = false
                        datasource = {
                            type = "datasource"
                            uid  = "grafana"
                        }
                        gridPos    = {
                            h = 1
                            w = 24
                            x = 0
                            y = 26
                        }
                        targets    = [
                            {
                                datasource = {
                                    type = "datasource"
                                    uid  = "grafana"
                                }
                            },
                        ]
                        title      = "Database"
                        type       = "row"
                    },
                    # (8 unchanged elements hidden)
                ]
                tags          = []
                # (19 unchanged attributes hidden)
            }
        )
        id           = "0:staging-cast"
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"%0A        name                               = "staging-cast-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:85" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:85" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-cast" -> (known after apply)%0A      ~ revision                 = 85 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.o11y.grafana_dashboard.dashboard will be updated in-place%0A  ~ resource "grafana_dashboard" "dashboard" {%0A      ~ config_json  = jsonencode(%0A          ~ {%0A              ~ panels        = [%0A                    # (5 unchanged elements hidden)%0A                    {%0A                        collapsed  = false%0A                        datasource = {%0A                            type = "datasource"%0A                            uid  = "grafana"%0A                        }%0A                        gridPos    = {%0A                            h = 1%0A                            w = 24%0A                            x = 0%0A                            y = 17%0A                        }%0A                        targets    = [%0A                            {%0A                                datasource = {%0A                                    type = "datasource"%0A                                    uid  = "grafana"%0A                                }%0A                            },%0A                        ]%0A                        title      = "ECS"%0A                        type       = "row"%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ matchExact       = false -> true%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                          ~ {%0A                              ~ matchExact       = false -> true%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (10 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets       = [%0A                          ~ {%0A                              ~ matchExact       = false -> true%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                          ~ {%0A                              ~ matchExact       = false -> true%0A                                # (13 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (10 unchanged attributes hidden)%0A                    },%0A                    {%0A                        collapsed  = false%0A                        datasource = {%0A                            type = "datasource"%0A                            uid  = "grafana"%0A                        }%0A                        gridPos    = {%0A                            h = 1%0A                            w = 24%0A                            x = 0%0A                            y = 26%0A                        }%0A                        targets    = [%0A                            {%0A                                datasource = {%0A                                    type = "datasource"%0A                                    uid  = "grafana"%0A                                }%0A                            },%0A                        ]%0A                        title      = "Database"%0A                        type       = "row"%0A                    },%0A                    # (8 unchanged elements hidden)%0A                ]%0A                tags          = []%0A                # (19 unchanged attributes hidden)%0A            }%0A        )%0A        id           = "0:staging-cast"%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*